kursovaya/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

H 75;
W 400;
l 40;
h 20;

// for block_1
ini_width #calc "$W / $l";

// for circle
pos_x #calc "$h / sqrt(2.0)";
pos_y $pos_x;

// values
pos_half_w #calc "$W / 2";
neg_half_w #calc "-$pos_half_w";
pos_half_h #calc "$H / 2";
neg_half_h #calc "-$pos_half_h";

middle_right #calc "$pos_half_w / 2";
middle_left #calc "-$middle_right";


vertices
(
    // first block front
    (-200 -37.5 1) 			// 0
    (-50 -37.5 1)    			// 1
    (-50 37.5 1)     			// 2
    (-200 37.5 1)    			// 3
    // second block back
    (-200 -37.5 -1)       		// 4
    (-50 -37.5 -1)   			// 5
    (-50 37.5 -1)   			// 6
    (-200 37.5 -1)   			// 7
    // centered block front
    (50 -37.5 1)    			// 8
    (200 -37.5 1)    			// 9
    (200 37.5 1)    			// 10
    (50 37.5 1)    			// 11
    // centered block back
    (50 -37.5 -1)   			// 12
    (200 -37.5 -1)   			// 13
    (200 37.5 -1)    			// 14
    (50 37.5 -1)    			// 15
    // circle block front
    (-14.142135624 -14.142135624 1) 	// 16
    (14.142135624 -14.142135624 1)	// 17
    (14.142135624 14.142135624 1)   	// 18
    (-14.142135624 14.142135624 1) 	// 19
    // circle block back
    (-14.142135624 -14.142135624 -1)	// 20
    (14.142135624 -14.142135624 -1)  	// 21
    (14.142135624 14.142135624 -1)   	// 22
    (-14.142135624 14.142135624 -1)  	// 23
);

blocks
(
//left block
    hex (0 1 5 4 3 2 6 7) (30 1 30) simpleGrading (1 1 1)
//cylinder blocks
    hex (1 8 12 5 16 17 21 20) (30 1 30) simpleGrading (1 1 1)//bottom
    hex (1 16 20 5 2 19 23 6) (30 1 30) simpleGrading (1 1 1)//left
    hex (19 18 22 23 2 11 15 6) (30 1 30) simpleGrading (1 1 1)//top
    hex (17 8 12 21 18 11 15 22) (30 1 30) simpleGrading (1 1 1)//right
//right block
    hex (8 9 13 12 11 10 14 15) (200 1 30) simpleGrading (1 1 1)
);

edges
(
	arc 16 17 (0 -20 -1)  // 0
	arc 21 20 (0 -20 1)  //1
	arc 19 16 (-20 0 -1) // 2
	arc 23 20 (-20 0 1) //3
	arc 19 18 (0 20 -1) // 4
	arc 23 22 (0 20 1) // 5
	arc 18 17 (20 0 -1)  // 6
	arc 22 21 (20  0 1) // 7
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 13 14 10)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (3 2 6 7)
            (2 11 15 6)
            (11 10 14 15)
            (0 1 5 4)
            (1 8 12 5)
            (8 9 13 12)
        );
    }
    cylinder
    {
	type wall;
	faces
	(
	    (16 17 21 20)
	    (17 18 22 21)
	    (19 18 22 23)
	    (16 19 23 20)
	);
    }
    frontAndBack
    {
    	type empty;
    	faces
    	(
    	    ( 0 1 2 3)
    	    ( 1 16 19 2)
    	    (19 18 11 2)
    	    (17 8 11 18)
    	    ( 1 8 17 16)
    	    (8 9 10 11)
    	    ( 4 7 6 5)
    	    ( 5 6 23 20)
    	    (23 6 15 22)
    	    (21 22 15 12)
    	    (5 20 21 12)
    	    (12 15 14 13)
    	);
    }
);

// ************************************************************************* //
