kursovaya/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       20650;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       20680;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          520;
        startFace       20710;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       21230;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21000;
        startFace       21350;
    }
)

// ************************************************************************* //
